
from discord.ext import commands as ебаный_модуль_команд_для_даунов
import discord as ебаня_библиотека_для_далбаебов

я_твой_рот_ебал = ебаный_модуль_команд_для_даунов.Bot(command_prefix= "яхуесос")

это_ебаное_событие_века = я_твой_рот_ебал.event
эта_ебаная_команда = я_твой_рот_ебал.command

@это_ебаное_событие_века
async def on_ready():
	print("я запустился! А ты нахуй иди, падаль")

@эта_ебаная_команда(пасс_контекст='да я далбаеб')
async def хуета(хуета):
	await хуета.send('я сасал меня ебали и тебя тоже!')

@эта_ебаная_команда(пасс_контекст='да я далбаеб')
async def ятвойротебал(хуета, хуесос_которого_надо_обозвать:ебаня_библиотека_для_далбаебов.Member):
	await хуета.send(f'{хуесос_которого_надо_обозвать.mention} я твой рот ебал')

@эта_ебаная_команда(пасс_контекст='да я далбаеб')
async def идисюдатварь(хуета):
	if хуета.author.voice.channel:
		await хуета.author.voice.channel.connect()



я_твой_рот_ебал.run('NjYwODk0ODI0MjUbMzU4MTEw.XfjgWA.554gJESNiUan1r0B2zE-r0dQGes')
